bit-finance/Reports/бит_УниверсальныйОтчетПоИсточникамДанных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>бит_УниверсальныйОтчетПоИсточникамДанных</Name>
		</Properties>
	</Report>
</MetaDataObject>

bit-finance/Catalogs/бит_НастройкиОтчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>бит_НастройкиОтчетов</Name>
			<Comment>(БИТ)</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИсточникДанных</Name>
					<Comment>Источник данных</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СпособыКомпоновкиИсточниковДанных</v8:Type>
						<v8:Type>cfg:CatalogRef.бит_ИсточникиДанных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СхемаКомпоновкиДанных</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Комментарий</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Язык</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Языки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаголовокОтчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантОтчета</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Параметры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Параметр</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидПараметра</Name>
							<Comment>Вид параметра</Comment>
							<Type>
								<v8:Type>cfg:EnumRef.бит_ВидыПараметровПроизвольныхОтчетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

bit-finance/Reports/бит_УниверсальныйОтчетПоИсточникамДанных/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// Задает расширенные настройки отчета.
//
// Параметры:
//   Настройки - Коллекция - настройки отчетов и вариантов отчетов конфигурации.
//   ОписаниеОтчета - СтрокаДерева
//                  - ОбъектМетаданных - описание настроек, метаданные или ссылка отчета.
//
Процедура НастроитьВариантыОтчета(Настройки, ОписаниеОтчета) Экспорт
	
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "Основной");
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;

КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ЗагрузитьНастройкиПриИзмененииПараметров() Экспорт 
	
	Параметры = Новый Массив;
	Параметры.Добавить(Новый ПараметрКомпоновкиДанных("НастройкаОтчета"));
	
	Возврат Параметры;
	
КонецФункции

Функция ФиксированныеПараметры(Настройки, ПользовательскиеНастройки, ДоступныеЗначения) Экспорт 
	
	// Значения параметров по умолчанию. 
	ФиксированныеПараметры = Новый Структура("НастройкаОтчета, Период, Язык");
	ДоступныеЗначения	   = Новый Структура;
	
	// Установим фиксированные настройки с учетом реквизитов справочника.
	Идентификаторы = ОбщегоНазначенияКлиентСервер.КлючиСтруктурыВСтроку(ФиксированныеПараметры, ",");
	Идентификаторы = СтрРазделить(Идентификаторы, ", ", Ложь);
	Для каждого Идентификатор Из Идентификаторы Цикл
		УстановитьФиксированныйПараметр(Идентификатор, ФиксированныеПараметры, Настройки, ПользовательскиеНастройки);	
	КонецЦикла; 
			
	Идентификаторы  = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве("НастройкаОтчета");
	ПараметрыДанных = Настройки.ПараметрыДанных.Элементы;
	Для Каждого Идентификатор Из Идентификаторы Цикл 
		ЭлементНастройки = ПараметрыДанных.Найти(Идентификатор);
		Если ЭлементНастройки = Неопределено
			ИЛИ ЭлементНастройки.Значение = ФиксированныеПараметры[Идентификатор] Тогда 
			Продолжить;
		КонецЕсли;
		
		Настройки.ДополнительныеСвойства.Вставить("ОтчетИнициализирован", Ложь);
		Прервать;
	КонецЦикла;
	
	Возврат ФиксированныеПараметры;
	
КонецФункции

// Устанавливает значения специализированных параметров универсального отчета.
//
// Параметры:
//  Отчет - 
//  ФиксированныеПараметры - см. ФиксированныеПараметры
//  Настройки - НастройкиКомпоновкиДанных - 
//  ПользовательскиеНастройки - ПользовательскиеНастройкиКомпоновкиДанных - 
//
Процедура УстановитьФиксированныеПараметры(Отчет, ФиксированныеПараметры, Настройки, ПользовательскиеНастройки) Экспорт 
	ПараметрыДанных = Настройки.ПараметрыДанных;
	
	ДоступныеПараметры = ПараметрыДанных.ДоступныеПараметры;
	Если ДоступныеПараметры = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	Для Каждого Параметр Из ФиксированныеПараметры Цикл 
		Если ДоступныеПараметры.Элементы.Найти(Параметр.Ключ) = Неопределено Тогда 
			Продолжить;
		КонецЕсли;
		
		ЭлементНастройки = ПараметрыДанных.Элементы.Найти(Параметр.Ключ);
		Если ЭлементНастройки = Неопределено Тогда 
			ЭлементНастройки = ПараметрыДанных.Элементы.Добавить();
			ЭлементНастройки.Параметр = Новый ПараметрКомпоновкиДанных(Параметр.Ключ);
			ЭлементНастройки.Значение = Параметр.Значение;
			ЭлементНастройки.Использование = Истина;
		Иначе
			ПараметрыДанных.УстановитьЗначениеПараметра(Параметр.Ключ, Параметр.Значение);
		КонецЕсли;
		
		ЭлементПользовательскойНастройки = Неопределено;
		Если ПользовательскиеНастройки <> Неопределено Тогда 
			ЭлементПользовательскойНастройки = ПользовательскиеНастройки.Элементы.Найти(
				ЭлементНастройки.ИдентификаторПользовательскойНастройки);
		КонецЕсли;
		
		Если ЭлементПользовательскойНастройки <> Неопределено Тогда 
			ЗаполнитьЗначенияСвойств(ЭлементПользовательскойНастройки, ЭлементНастройки, "Использование, Значение");
		КонецЕсли;
	КонецЦикла;
	
	Если ПользовательскиеНастройки <> Неопределено Тогда 
		ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("ОтчетИнициализирован", Истина);
	КонецЕсли;
КонецПроцедуры

Функция СхемаКомпоновкиДанных(ФиксированныеПараметры) Экспорт 
	
	СхемаКомпоновкиДанных 		  = Неопределено;	
	ОсновнаяСхемаКомпоновкиДанных = ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	
	Если ЗначениеЗаполнено(ФиксированныеПараметры.НастройкаОтчета) Тогда
		РеквизитыНастройки 	  = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ФиксированныеПараметры.НастройкаОтчета,
									"СхемаКомпоновкиДанных");
		
		СхемаКомпоновкиДанных = РеквизитыНастройки.СхемаКомпоновкиДанных.Получить();
		
		ВариантыНастроек = СхемаКомпоновкиДанных.ВариантыНастроек;
		Если СхемаКомпоновкиДанных.ВариантыНастроек.Количество() = 0 Тогда
			ТекстСообщения = НСтр("ru = 'Схема компоновки данных настройки ""%1"" не содержит вариантов настроек.'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, ФиксированныеПараметры.НастройкаОтчета);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ФиксированныеПараметры.НастройкаОтчета);
		Иначе
			Справочники.бит_НастройкиОтчетов.ДобавитьФиксированныеПереметры(СхемаКомпоновкиДанных);
			
			Для каждого НаборДанных Из СхемаКомпоновкиДанных.НаборыДанных Цикл
				бит_МеханизмДопИзмерений.НастроитьПоляДополнительныхИзмеренийВСКД(СхемаКомпоновкиДанных, НаборДанных.Имя);				
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	Если СхемаКомпоновкиДанных = Неопределено Тогда
		СхемаКомпоновкиДанных = ОсновнаяСхемаКомпоновкиДанных;
	КонецЕсли;
	
	Возврат СхемаКомпоновкиДанных;
	
КонецФункции

// Устанавливает настройки по умолчанию.
//
// Параметры:
//  Отчет - ОтчетОбъект - 
//  ФиксированныеПараметры - см. ФиксированныеПараметры
//  Настройки - НастройкиКомпоновкиДанных - 
//  ПользовательскиеНастройки - ПользовательскиеНастройкиКомпоновкиДанных - 
//
Процедура УстановитьСтандартныеНастройки(Отчет, ФиксированныеПараметры, Настройки, ПользовательскиеНастройки) Экспорт 
	
	ОтчетИнициализирован = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
		Настройки.ДополнительныеСвойства, "ОтчетИнициализирован", Ложь);
	
	Если ОтчетИнициализирован Тогда 
		Возврат;
	КонецЕсли;
	
	РежимыОтображенияФиксированныхПараметров = РежимыОтображенияФиксированныхПараметров(Настройки);

	ОсновнойВариантОтчета = Отчет.СхемаКомпоновкиДанных.НастройкиПоУмолчанию;
	
	ДополнительныеСвойстваНастройки = ОбщегоНазначения.СкопироватьРекурсивно(Отчет.КомпоновщикНастроек.Настройки.ДополнительныеСвойства);
	
	Если ЗначениеЗаполнено(ФиксированныеПараметры.НастройкаОтчета) Тогда
		РеквизитыНастройки = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ФиксированныеПараметры.НастройкаОтчета, 
								"ВариантОтчета, ИсточникДанных");
		ВариантИзНастройки = РеквизитыНастройки.ВариантОтчета.Получить();
		Если ТипЗнч(ВариантИзНастройки) = Тип("Строка") Тогда
			ОсновнойВариантОтчета = ОбщегоНазначения.ЗначениеИзСтрокиXML(ВариантИзНастройки);
		КонецЕсли;
		
		Отчет.КомпоновщикНастроек.ЗагрузитьНастройки(ОсновнойВариантОтчета);
		ПользовательскиеНастройки = Отчет.КомпоновщикНастроек.ПользовательскиеНастройки;

		ДоступныеЗначения = ДоступныеЗначенияПараметровИзНастройкиОтчета(ФиксированныеПараметры.НастройкаОтчета);
		
		бит_ОтчетыБФКлиентСервер.УстановитьПараметр(ПользовательскиеНастройки, "НастройкаОтчета", 
			ФиксированныеПараметры.НастройкаОтчета);
			
		бит_ОтчетыБФКлиентСервер.УстановитьПараметр(ПользовательскиеНастройки, "НастройкиИсточника", 
			ДоступныеЗначения.НастройкиИсточника);
			
		ФиксированныеПараметры.Язык = ДоступныеЗначения.Язык;
	Иначе
		Отчет.КомпоновщикНастроек.ЗагрузитьНастройки(ОсновнойВариантОтчета);
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(Отчет.КомпоновщикНастроек.Настройки.ДополнительныеСвойства, 
		ДополнительныеСвойстваНастройки, Ложь);
	
	Настройки = Отчет.КомпоновщикНастроек.Настройки;
	
	УстановитьРежимыОтображенияФиксированныхПараметров(Настройки, РежимыОтображенияФиксированныхПараметров);
	УстановитьФиксированныеПараметры(Отчет, ФиксированныеПараметры, Настройки, ПользовательскиеНастройки);

	УстановитьЗаголовкиПолей(Отчет.СхемаКомпоновкиДанных, Настройки, ФиксированныеПараметры);
	
	Настройки.ДополнительныеСвойства.Вставить("ОтчетИнициализирован", Истина);
	
КонецПроцедуры

Процедура УстановитьСтандартныйЗаголовокОтчета(Контекст, Настройки, ФиксированныеПараметры, ДоступныеЗначения) Экспорт 
	
	//Если Не УстановкаСтандартногоЗаголовкаОтчетаДоступна(Контекст) Тогда 
	//	Возврат;
	//КонецЕсли;
	
	ЗначенияПараметров   = ЗначенияПараметровСтандартногоЗаголовка(Контекст, ФиксированныеПараметры, ДоступныеЗначения);
	ПредставлениеПериода = ПредставлениеПериодаОтчета(ЗначенияПараметров.Период);
	ПредставлениеОтчета	 = Метаданные.Отчеты.бит_УниверсальныйОтчетПоИсточникамДанных.Представление();
	
	Если НЕ ЗначениеЗаполнено(ЗначенияПараметров.НастройкаОтчета) 
		И НЕ ЗначениеЗаполнено(ПредставлениеПериода) Тогда
		Заголовок = ПредставлениеОтчета;
	ИначеЕсли НЕ ЗначениеЗаполнено(ЗначенияПараметров.НастройкаОтчета) 
		И ЗначениеЗаполнено(ПредставлениеПериода) Тогда
		Заголовок = СтрШаблон(НСтр("ru = '%1 за %2'"),ПредставлениеОтчета, ПредставлениеПериода);
	ИначеЕсли ЗначениеЗаполнено(ЗначенияПараметров.НастройкаОтчета) 
		И НЕ ЗначениеЗаполнено(ПредставлениеПериода) Тогда	
		Заголовок = СтрШаблон(НСтр("ru = '%1'"), ЗначенияПараметров.НастройкаОтчета);			
	Иначе	
		Заголовок = СтрШаблон(НСтр("ru = '%1 за %2'"),
				ЗначенияПараметров.НастройкаОтчета, ПредставлениеПериода);
	КонецЕсли;
	
	ЗаголовокУстановленИнтерактивно = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
		Настройки.ДополнительныеСвойства, "ЗаголовокУстановленИнтерактивно", Ложь);
	
	Если Не ЗаголовокУстановленИнтерактивно Тогда 
		ПараметрЗаголовка = Настройки.ПараметрыВывода.Элементы.Найти("Заголовок");
		ПараметрЗаголовка.Значение = Заголовок;
	КонецЕсли;
	
	Если ТипЗнч(Контекст) = Тип("ФормаКлиентскогоПриложения")
		И Контекст.ТипФормыОтчета = ТипФормыОтчета.Основная Тогда 
		
		Контекст.Заголовок = Заголовок;
		Контекст.ОтчетНаименованиеТекущегоВарианта = Заголовок;
	КонецЕсли;
	
КонецПроцедуры 

Процедура УстановитьЗаголовкиПолей(СхемаКомпоновкиДанных, Настройки, ФиксированныеПараметры) Экспорт

	НастройкаОтчета = ФиксированныеПараметры.НастройкаОтчета;
	Язык			= ФиксированныеПараметры.Язык;
	
	Если НЕ ЗначениеЗаполнено(НастройкаОтчета) ИЛИ НЕ ЗначениеЗаполнено(Язык) Тогда
		Возврат;	
	КонецЕсли;

	РеквизитыНастройки = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(НастройкаОтчета, "Параметры, ЗаголовокОтчета");
	КодЯзыка		   = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Язык, "КодЯзыка");
	
	ЗаголовокОтчета = НСтр(РеквизитыНастройки.ЗаголовокОтчета, КодЯзыка);
	Если ЗначениеЗаполнено(ЗаголовокОтчета) Тогда
		Настройки.ПараметрыВывода.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Title")).Значение = ЗаголовокОтчета;
	КонецЕсли;
	
	ЗаголовкиПолей = РеквизитыНастройки.Параметры.Выгрузить();
	Если НЕ ЗначениеЗаполнено(ЗаголовкиПолей) Тогда
		Возврат;
	КонецЕсли;
	
	Для каждого НаборДанных Из СхемаКомпоновкиДанных.НаборыДанных Цикл
		ПоляНабораДанных = НаборДанных.Поля;
		Для каждого ПолеНабора Из ПоляНабораДанных Цикл   			 
			РезультатПоиска = ЗаголовкиПолей.Найти(ПолеНабора.Поле, "Параметр");
			Если РезультатПоиска <> Неопределено Тогда
				НовоеЗначение = СокрЛП(НСтр(РезультатПоиска.Значение, КодЯзыка));
				Если ЗначениеЗаполнено(НовоеЗначение) Тогда
					ПолеНабора.Заголовок = НовоеЗначение;
				КонецЕсли;
			КонецЕсли;  
		КонецЦикла;
	КонецЦикла;

	Для каждого МакетСхемы Из СхемаКомпоновкиДанных.Макеты Цикл
		Для каждого СтрокаТаблицыОбласти Из МакетСхемы.Макет Цикл
			Для каждого ЯчейкаТаблицыОбласти Из СтрокаТаблицыОбласти.Ячейки Цикл
				Для каждого ПолеОбласти Из ЯчейкаТаблицыОбласти.Элементы Цикл
					
					// Значение поля области компоновки данных.     						
					ЗначениеПоля = ПолеОбласти.Значение;
					// Если тип значения = Строка, то нужно подставить заголовки.
					Если ТипЗнч(ЗначениеПоля) = Тип("Строка") Тогда
						
						// Поиск вхождений параметров для замены: [ИмяПараметра].
						РезультатРазбора = бит_СтрокиКлиентСервер.РазобратьСтрокуСРазделителями(ЗначениеПоля, "[");
						Для каждого СтрокаПоиска Из РезультатРазбора Цикл
							ПозицияЗакрытия = Найти(СтрокаПоиска, "]");
							Если ПозицияЗакрытия = 0 Тогда
								Продолжить;
							Иначе	
								СтрокаПараметр = Лев(СтрокаПоиска, ПозицияЗакрытия - 1);
								СтрТчПараметры = ЗаголовкиПолей.Найти(СтрокаПараметр, "Параметр");
								Если СтрТчПараметры <> Неопределено Тогда
									НовоеЗначение = СокрЛП(НСтр(СтрТчПараметры.Значение, КодЯзыка));
									СтрокаПараметр = "[" + СтрокаПараметр + "]";
									ПолеОбласти.Значение = СтрЗаменить(ПолеОбласти.Значение, СтрокаПараметр, НовоеЗначение);
								КонецЕсли;
							КонецЕсли;
						КонецЦикла;
					КонецЕсли;
				КонецЦикла;		
			КонецЦикла;			
		КонецЦикла; 		
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура УстановитьФиксированныйПараметр(Идентификатор, Параметры, Настройки, ПользовательскиеНастройки, ДоступныеЗначения = Неопределено)
	
	ФиксированныйПараметр = Параметры[Идентификатор];
	
	Если ДоступныеЗначения = Неопределено Тогда 
		ДоступныеЗначения = Новый СписокЗначений;
	КонецЕсли;
	
	ЭлементНастройки = Настройки.ПараметрыДанных.Элементы.Найти(Идентификатор);
	Если ЭлементНастройки = Неопределено Тогда 
		Если ДоступныеЗначения.Количество() > 0 Тогда 
			Параметры[Идентификатор] = ДоступныеЗначения[0].Значение;
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	ЭлементПользовательскойНастройки = Неопределено;
	Если ТипЗнч(ПользовательскиеНастройки) = Тип("ПользовательскиеНастройкиКомпоновкиДанных")
		И (Настройки.ДополнительныеСвойства.Свойство("ОтчетИнициализирован")
		Или ПользовательскиеНастройки.ДополнительныеСвойства.Свойство("ОтчетИнициализирован")) Тогда 
		
		ЭлементПользовательскойНастройки = ПользовательскиеНастройки.Элементы.Найти(
			ЭлементНастройки.ИдентификаторПользовательскойНастройки);
	КонецЕсли;
	
	Если ЭлементПользовательскойНастройки <> Неопределено
		И ДоступныеЗначения.НайтиПоЗначению(ЭлементПользовательскойНастройки.Значение) <> Неопределено Тогда 
		ФиксированныйПараметр = ЭлементПользовательскойНастройки.Значение;
	ИначеЕсли ДоступныеЗначения.НайтиПоЗначению(ЭлементНастройки.Значение) <> Неопределено Тогда 
		ФиксированныйПараметр = ЭлементНастройки.Значение;
	ИначеЕсли ДоступныеЗначения.Количество() > 0 Тогда 
		ФиксированныйПараметр = ДоступныеЗначения[0].Значение;
	ИначеЕсли ЭлементПользовательскойНастройки <> Неопределено
		И ЗначениеЗаполнено(ЭлементПользовательскойНастройки.Значение) Тогда 
		ФиксированныйПараметр = ЭлементПользовательскойНастройки.Значение;
	ИначеЕсли ЗначениеЗаполнено(ЭлементНастройки.Значение) Тогда 
		ФиксированныйПараметр = ЭлементНастройки.Значение;
	КонецЕсли;
	
	Параметры[Идентификатор] = ФиксированныйПараметр;
	
КонецПроцедуры

Процедура УстановитьРежимыОтображенияФиксированныхПараметров(Настройки, РежимыОтображения)
	
	Параметры = Настройки.ПараметрыДанных.Элементы;
	
	Для Каждого РежимОтображения Из РежимыОтображения Цикл 
		
		НайденныйПараметр = Параметры.Найти(РежимОтображения.Ключ);
		
		Если НайденныйПараметр <> Неопределено Тогда 
			НайденныйПараметр.РежимОтображения = РежимыОтображения[РежимОтображения.Ключ];
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция РежимыОтображенияФиксированныхПараметров(Настройки)

	РежимыОтображения = Справочники.бит_НастройкиОтчетов.РежимыОтображенияФиксированныхПараметров(Настройки);
	
	Возврат РежимыОтображения;
	
КонецФункции

Функция УстановкаСтандартногоЗаголовкаОтчетаДоступна(Контекст)
	
	Если ТипЗнч(Контекст) = Тип("ФормаКлиентскогоПриложения") Тогда 
		ВариантОтчета = Контекст.НастройкиОтчета.ВариантСсылка;
	Иначе
		ВариантОтчета = Контекст.СсылкаВарианта;
	КонецЕсли;
	
	Возврат ВариантыОтчетов.ЭтоПредопределенныйВариантОтчета(ВариантОтчета);
	
КонецФункции

Функция ЗначенияПараметровСтандартногоЗаголовка(Контекст, ФиксированныеПараметры, ДоступныеЗначения)
	
	ЗначенияПараметров = Новый Структура("НастройкаОтчета, Период");
	
	Если ТипЗнч(Контекст) = Тип("ФормаКлиентскогоПриложения") Тогда 
		АдресСхемы = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Контекст.НастройкиОтчета, "АдресСхемы");
	Иначе
		АдресСхемы = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Контекст, "АдресСхемы");
	КонецЕсли;
	
	Схема = ПолучитьИзВременногоХранилища(АдресСхемы); // СхемаКомпоновкиДанных
	
	Для Каждого Элемент Из ЗначенияПараметров Цикл 
		
		НайденныйПараметр = Схема.Параметры.Найти(Элемент.Ключ);
		Если НайденныйПараметр = Неопределено
			Или НайденныйПараметр.ОграничениеИспользования Тогда 
			
			Продолжить;
		КонецЕсли;
		
		ЗначениеПараметра = ФиксированныеПараметры[Элемент.Ключ];
		
		ДоступныеЗначенияПараметра = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
			ДоступныеЗначения, Элемент.Ключ);
		
		Если  ЗначениеЗаполнено(ЗначениеПараметра)
			И ТипЗнч(ДоступныеЗначенияПараметра) = Тип("СписокЗначений") Тогда 
			
			НайденноеЗначение = ДоступныеЗначенияПараметра.НайтиПоЗначению(ЗначениеПараметра);
			ЗначенияПараметров[Элемент.Ключ] = НайденноеЗначение.Представление;
		Иначе
			ЗначенияПараметров[Элемент.Ключ] = ?(ЗначениеЗаполнено(ЗначениеПараметра), ЗначениеПараметра, Неопределено);
		КонецЕсли;
	КонецЦикла;
	
	Возврат ЗначенияПараметров;
	
КонецФункции

Функция ПредставлениеПериодаОтчета(Период)
	
	ПредставлениеПериода = "";
	
	Если Период = Неопределено
		Или ТипЗнч(Период) <> Тип("СтандартныйПериод") Тогда 
		
		Возврат ПредставлениеПериода;
	КонецЕсли;
	
	Возврат СтроковыеФункции.ПредставлениеПериодаВТексте(Период.ДатаНачала, Период.ДатаОкончания);
	
КонецФункции

Функция ДоступныеЗначенияПараметровИзНастройкиОтчета(НастройкаОтчета)
	
	Возврат Справочники.бит_НастройкиОтчетов.ДоступныеЗначенияПараметровИзНастройкиОтчета(НастройкаОтчета);
	
КонецФункции

#КонецОбласти

#КонецЕсли
